# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [27]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [31]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  1  2  27598
1  4  1  28891
2  2  1  22059
3  3  1  27489
4  1  1  27269

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [33]:
df_2 = housemkt.rename(columns={'0':'bedrs',
                                   '1':'bathrs',
                                   '2':'price_sqr_meter',
                                  })
df_2

    método  número  periodo_orbital
0        1       2            17238
1        2       2            27801
2        2       1            20337
3        1       1            13244
4        4       1            24381
..     ...     ...              ...
95       3       1            23665
96       4       1            23556
97       2       2            17597
98       2       3            17582
99       4       3            13480

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [39]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn.to_frame()

        0
0       1
1       4
2       2
3       3
4       1
..    ...
95  27425
96  24910
97  29790
98  21269
99  10663

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [40]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.to_frame()

         0
0        1
1        4
2        2
3        3
4        1
..     ...
295  27425
296  24910
297  29790
298  21269
299  10663

[300 rows x 1 columns]